bradlc.vscode-tailwindcss
clemenspeters.format-json
davidanson.vscode-markdownlint
eamodio.gitlens
esbenp.prettier-vscode
github.copilot-chat
google.gemini-cli-vscode-ide-companion
grapecity.gc-excelviewer
mechatroner.rainbow-csv
mhutchie.git-graph
midudev.better-svg
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
pkief.material-icon-theme
redhat.vscode-yaml
roscop.activefileinstatusbar
shd101wyy.markdown-preview-enhanced
sst-dev.opencode
zhuangtongfa.material-theme
